36/data/attachments/5d1455f96ea6b60.txt

INFO     root:api_helper.py:33 Пользователь Shelley Soto зарегистрирован
INFO     root:api_helper.py:33 Пользователь Kelly Davis зарегистрирован
INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "388"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Shelley Soto</nif:username>
            <nif:friendToBeRequested>Kelly Davis</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "415",
  "Date": "Mon, 23 Jun 2025 11:06:01 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:userResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>9bcb3fdd-fc68-4a7e-bf1a-96030d816adf</ns2:id><ns2:username>Kelly Davis</ns2:username><ns2:currency>RUB</ns2:currency><ns2:friendshipStatus>INVITE_SENT</ns2:friendshipStatus></ns2:user></ns2:userResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'